skills/dgx-capture/fixtures/fake-outputs/vllm-bench.txt
============ Serving Benchmark Result ============
Successful requests:                     16
Benchmark duration (s):                  38.12
Total input tokens:                      4096
Total generated tokens:                  4096
Request throughput (req/s):              0.42
Output token throughput (tok/s):         107.45
Total Token throughput (tok/s):          214.90
---------------Time to First Token----------------
Mean TTFT (ms):                          412.30
Median TTFT (ms):                        398.10
P99 TTFT (ms):                           611.80
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          23.90
Median TPOT (ms):                        23.70
P99 TPOT (ms):                           25.10
==================================================